; 本文件是 iEdge (iEdge.dll) 的配置文件，采用INI格式
; 分号（;）开始的行是注释语句，不会产生实际作用

[启动参数]
--user-data-dir="..\USER." --disable-background-networking --disable-backing-store-limit
;这里定义的Edge命令参数，可在Edge启动时自动插入,  只有第一行有效

;设置缓存目录
;--disk-cache-dir=%app%\Cache

;设置界面缩放
;--force-device-scale-factor=1

;最大化启动窗口
;--start-maximized


[界面增强]
快捷方式=0

;打开新标签直接跳转到主页
新标签打开主页=0

;地址栏输入的网址在新标签中打开
新标签打开网址=1

;按住鼠标右键时，滚动鼠标可切换标签
右键快速标签切换=1

;鼠标悬停在标签页一定时间将会自动激活标签页
悬停激活标签页=0

;悬停多久后激活标签页，单位毫秒，不填为系统默认值
悬停时间=


[鼠标手势]
;关闭后可以使用别的鼠标手势（还得关闭右键快速标签切换）
启用=1

;是否显示识别结果
动作=0

;是否显示鼠标轨迹
轨迹=1

#不要设置得太粗
轨迹粗细=5

#颜色格式为RGB 16进制
轨迹颜色=337AB7

;支持四个手势方向：↑↓←→
;自定义格式为：方向=名称|发送按键
;可以自由修改添加，但是功能只能是发送快捷键而已
↑=打开主页|Ctrl+T
↓=页面底部|End
←=后退|Alt+←
→=前进|Alt+→
↓↑=刷新|F5
↑↓=强制刷新|Ctrl+F5
↓→=关闭标签|Ctrl+W
↓←=撤销关闭|Ctrl+Shift+T
→↑=上翻页|PageUp
→↓=下翻页|PageDown
↑←=切换到右侧标签|Ctrl+PageUp
↑→=切换到左侧标签|Ctrl+PageDown
